Repository: BuraTom/awud_creat
Catalog: lib/l10n/app_*.arb
Languages: am

# st
source: Settings
am: ቅንብሮች

# changelang
source: Change Language
am: ቋንቋ ቀይር

# mu
source: Music
am: ተጫውቷል

# pod
source: Podcast
am: ፖድካስት

# aud
source: Audiobook
am: ኦዲዮ መጽሐፍ

# dow
source: Downloaded
am: ወርዷል

# fav
source: Favourite
am: የሚወደድ

# playls
source: Playlists
am: አጫዋች ዝርዝሮች

# al
source: Albums
am: አልበሞች

# eps
source: episodes
am: ክፍሎች

# ep
source: Episode
am: ክፍል

# ab
source: About
am: ስለ

# disc
source: Description
am: መግለጫ

# cr
source: Creator
am: ፈጣሪ

# dash
source: Dashboard
am: ዳሽቦርድ

# pla
source: PLAYS
am: ተጫውቷል

# lk
source: likes
am: ይወዳል

# dws
source: downloads
am: ውርዶች

# lis
source: Listeners
am: አድማጮች

# me
source: Money earned
am: የተገኘው ገንዘብ

# va
source: VIEW ALL
am: ሁሉንም ይመልከቱ

# tp
source: TOP PERFORMING CONTENTS
am: ከፍተኛ አፈጻጸም ያላቸው ይዘቶች

# lp
source: Last 7 days
am: ያለፉት 7 ቀናት

# est
source: Estimated
am: የሚገመተው

# qu
source: QUICK STATS
am: ፈጣን ስታቲስቲክስ

# con
source: Contents
am: ይዘቶች

# lan
source: languages
am: ቋንቋዎች

# chu
source: change Username
am: የተጠቃሚ ስም ቀይር

# chp
source: Change Password
am: የሚስጥር ቁልፍ ይቀይሩ

# chl
source: Change Language
am: ቋንቋ ቀይር

# so
source: Sign Out
am: ዛግተ ውጣ

# as
source: Account Snapshot
am: የመለያ ቅጽበታዊ ገጽ እይታ

# pa
source: Playlist adds
am: አጫዋች ዝርዝር ይጨምራል

# ys
source: yesterday
am: ትናንት

# lm
source: last month
am: ባለፈው ወር

# tot
source: total
am: ጠቅላላ

source: All
am: ሁሉም

# up
source: Uploads
am: ሰቀላዎች

# nu
source: You have nothing Uploaded yet
am: እስካሁን ምንም የተሰቀለ ነገር የለዎትም

# nmu
source: You have no Music Uploaded yet
am: እስካሁን ምንም የተሰቀለ ሙዚቃ የሎትም

# npu
source: You have no Podcast Uploaded yet
am: እስካሁን ምንም የተሰቀለ ፖድካስት የሎትም

# nau
source: You have no AudioBook Uploaded yet
am: እስካሁን ምንም የተሰቀለ ኦዲዮ መጽሐፍ የሎትም

# acc
source: Account
am: መለያ

# dt
source: Dark Theme
am: ጨለማ ጭብጥ

# ur
source: Upload Request
am: የመጫን ጥያቄ
